In [ ]:
import pandas as pd
# Read file where each CSV row is wrapped in quotes
raw = pd.read_csv('students.csv', header=None, dtype=str)
# remove outer quotes from each line if present
lines = raw.iloc[:, 0].astype(str).str.replace('^"|"$','', regex=True)
# split into columns and set header from first row
df = lines.str.split(',', expand=True)
df.columns = df.iloc[0]
df = df[1:].reset_index(drop=True)
# convert numeric columns
df['Marks'] = pd.to_numeric(df['Marks'], errors='coerce')
df['ID'] = pd.to_numeric(df['ID'], errors='coerce')
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')
df['Attendance'] = pd.to_numeric(df['Attendance'], errors='coerce')
df

   ID,Name,Age,Marks,Class,Gender,City,Attendance
0                    1,John,17,85,12,M,Chennai,92
1                2,Meena,16,92,11,F,Coimbatore,95
2                    3,Arun,18,76,12,M,Chennai,88
3                   4,Priya,17,89,11,F,Madurai,97
4                    5,Kumar,16,95,10,M,Trichy,90
5                    6,Ravi,17,55,10,M,Chennai,80
6                   7,Sneha,18,78,12,F,Madurai,91
7                    8,Ramesh,17,66,11,M,Salem,84
8                   9,Divya,16,88,10,F,Chennai,94
9               10,Vijay,18,45,12,M,Coimbatore,72
10                11,Anitha,17,91,11,F,Chennai,96
11               12,Karthik,16,63,10,M,Madurai,83
12                13,Shalini,17,74,12,F,Trichy,88
13                  14,Naveen,18,82,12,M,Salem,90
14             15,Harini,16,69,11,F,Coimbatore,91
15               16,Prakash,17,87,11,M,Chennai,95
16                 17,Sahana,18,93,12,F,Trichy,97
17                 18,Gokul,16,52,10,M,Chennai,76
18                 19,Deepa,17,81,11,F,Madurai,92
19                   20,Mohan,18,77,12,M,Salem,85
20            21,Lakshmi,16,96,10,F,Coimbatore,98
21             22,Saravanan,17,83,11,M,Chennai,89
22                  23,Asha,18,68,12,F,Madurai,90
23                 24,Tharun,17,72,11,M,Trichy,87
24               25,Preethi,16,90,10,F,Chennai,95
25                    26,Ajay,18,58,12,M,Salem,78
26             27,Sindhu,17,80,11,F,Coimbatore,93
27                  28,Bala,16,71,10,M,Chennai,86
28                29,Keerthi,18,94,12,F,Trichy,99
29                30,Sudhan,17,67,11,M,Madurai,82
30                31,Mithun,16,62,10,M,Chennai,84
31            32,Revathi,17,88,11,F,Coimbatore,96
32                33,Aravind,18,73,12,M,Trichy,89
33                34,Nithya,16,85,10,F,Madurai,92
34                35,Sanjay,17,57,11,M,Chennai,80
35           36,Pavithra,18,92,12,F,Coimbatore,97
36                 37,Venkat,16,64,10,M,Trichy,83
37                38,Swathi,17,79,11,F,Chennai,90
38                   39,Manoj,18,53,12,M,Salem,75
39                40,Geetha,16,87,10,F,Madurai,94
40            41,Yuvaraj,17,70,11,M,Coimbatore,88
41                 42,Kavya,18,91,12,F,Chennai,95
42                 43,Dinesh,16,66,10,M,Trichy,82
43                44,Varsha,17,84,11,F,Madurai,93
44                  45,Suresh,18,59,12,M,Salem,77
45                46,Anu,16,97,10,F,Coimbatore,99
46                47,Vishwa,17,75,11,M,Chennai,86
47                48,Rithika,18,89,12,F,Trichy,95
48                 49,Shyam,16,50,10,M,Madurai,70
49                50,Monika,17,82,11,F,Chennai,92

In [5]:

df.shape

(50, 1)

In [6]:
df.columns

Index(['ID,Name,Age,Marks,Class,Gender,City,Attendance'], dtype='object')

In [8]:
df.size

50

In [9]:
df.head()

  ID,Name,Age,Marks,Class,Gender,City,Attendance
0                   1,John,17,85,12,M,Chennai,92
1               2,Meena,16,92,11,F,Coimbatore,95
2                   3,Arun,18,76,12,M,Chennai,88
3                  4,Priya,17,89,11,F,Madurai,97
4                   5,Kumar,16,95,10,M,Trichy,90

In [11]:
df.tail()

   ID,Name,Age,Marks,Class,Gender,City,Attendance
45                46,Anu,16,97,10,F,Coimbatore,99
46                47,Vishwa,17,75,11,M,Chennai,86
47                48,Rithika,18,89,12,F,Trichy,95
48                 49,Shyam,16,50,10,M,Madurai,70
49                50,Monika,17,82,11,F,Chennai,92

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 1 columns):
 #   Column                                          Non-Null Count  Dtype
---  ------                                          --------------  -----
 0   ID,Name,Age,Marks,Class,Gender,City,Attendance  50 non-null     object
dtypes: object(1)
memory usage: 532.0+ bytes

In [14]:
df.describe()

       ID,Name,Age,Marks,Class,Gender,City,Attendance
count                                              50
unique                                             50
top                      1,John,17,85,12,M,Chennai,92
freq                                                1